In [1]:
import pandas as pd
import numpy as np
data= {'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]}
df = pd.DataFrame(data)

### creation

In [2]:
df['E']=[1,11,1111,1111]

In [3]:
df

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111

In [4]:
df.loc[4]= [1,2,3,4]

In [5]:
df

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
4  1  2   3     4

In [6]:
df.rename(columns = {'D':'E'})

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
4  1  2   3     4

In [7]:
df.rename(index={4:5})

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
5  1  2   3     4

In [8]:
df = pd.DataFrame({'A':["AAA","bbb","Abc"],'B':["AAA","BBB","CCC"]})

In [9]:
df['A'].str.islower().sum()

1

In [10]:
df1 = pd.DataFrame({'Name':["Arun Chauhan","Ram Kumar"," Shyam Singh"],'Score':[12,15,18]})

In [11]:
df1[["F_name","L_name"]] = df1["Name"].str.split(expand = True)

In [12]:
df1

           Name  Score F_name   L_name
0  Arun Chauhan     12   Arun  Chauhan
1     Ram Kumar     15    Ram    Kumar
2   Shyam Singh     18  Shyam    Singh

In [13]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

df = pd.DataFrame(data)

In [14]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [15]:
for index,row in df.iterrows():
    print(index,row['Name'])

0 Alice
1 Bob
2 Charlie

In [16]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [17]:
df.rename(columns = {'Name':'F_Name'},inplace = True)
df

    F_Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [18]:
data = {'name':['karan','prakash','surya'],'scores':[100,10,55]}

In [19]:
df = pd.DataFrame(data)
df

      name  scores
0    karan     100
1  prakash      10
2    surya      55

In [20]:
df['total']=[100,100,100]

In [21]:
df

      name  scores  total
0    karan     100    100
1  prakash      10    100
2    surya      55    100

In [22]:
df.loc[3] = ['mady',25,100]

In [23]:
df.iloc[3]

name      mady
scores      25
total      100
Name: 3, dtype: object

In [24]:
df

      name  scores  total
0    karan     100    100
1  prakash      10    100
2    surya      55    100
3     mady      25    100

In [25]:
df.rename({'name':'naam'},inplace = True, axis =1)

In [26]:
df

      naam  scores  total
0    karan     100    100
1  prakash      10    100
2    surya      55    100
3     mady      25    100

In [27]:
df.rename({0:4},inplace = True,axis = 0)

      naam  scores  total
4    karan     100    100
1  prakash      10    100
2    surya      55    100
3     mady      25    100

In [32]:
df['naam'].str.islower().sum()

4

In [4]:
#For Numeric columns in DataFrame,
#find the mean of the entire column and add that mean value to each row of these numeric columns.

import pandas as pd
df = pd.DataFrame({'Name':["Arun Chauhan","Ram Kumar"," Shyam Singh"],'Score':[12,15,18],'Total':[20,20,20]})

In [7]:
df

           Name  Score  Total
0  Arun Chauhan     12     20
1     Ram Kumar     15     20
2   Shyam Singh     18     20

In [8]:
for column in df.columns:
    if df[column].dtype != 'O':
        mean = df[column].mean()
        df[column]+= mean

In [9]:
df

           Name  Score  Total
0  Arun Chauhan   27.0   40.0
1     Ram Kumar   30.0   40.0
2   Shyam Singh   33.0   40.0

In [12]:
df_num = df.select_dtypes(['number'])
df_num

   Score  Total
0   27.0   40.0
1   30.0   40.0
2   33.0   40.0

In [13]:
df_mean  = df_num.mean()
df_mean

Score    30.0
Total    40.0
dtype: float64

## creation

In [4]:
import pandas as pd
df = pd.DataFrame(data = [['karan',23],['praksh',72],['sam',100]],columns = ['name','marks'])

In [5]:
df

     name  marks
0   karan     23
1  praksh     72
2     sam    100

In [6]:
df = pd.DataFrame({'name':['karan','sam','mohit'],'marks':[23,45,68]})
df

    name  marks
0  karan     23
1    sam     45
2  mohit     68

## insertion

In [8]:
df['col1'] = [78,78,89]

In [9]:
df

    name  marks  col1
0  karan     23    78
1    sam     45    78
2  mohit     68    89

In [10]:
df.loc[3]=['sam',89,78]

In [11]:
df

    name  marks  col1
0  karan     23    78
1    sam     45    78
2  mohit     68    89
3    sam     89    78

### indexing

#### basically first condition is for row second second is for column

In [15]:
df.loc[0:2,['name','marks']]

    name  marks
0  karan     23
1    sam     45
2  mohit     68

now i will apply certain condition for row

i want rows where marks value are greater than 25

In [17]:
df.loc[df['marks']>25]

    name  marks  col1
1    sam     45    78
2  mohit     68    89
3    sam     89    78

i want name of student whose marks >36

In [19]:
df.loc[df['marks']>36,'name']

1      sam
2    mohit
3      sam
Name: name, dtype: object

### Replace Value

change mohit to mohan

In [20]:
df.loc[2,'name'] = 'mohan'

In [21]:
df

    name  marks  col1
0  karan     23    78
1    sam     45    78
2  mohan     68    89
3    sam     89    78

## index

In [24]:
df.set_index('name',drop = True,inplace = True)

In [25]:
df

       marks  col1
name
karan     23    78
sam       45    78
mohan     68    89
sam       89    78

In [27]:
df = pd.DataFrame({'name':['karan','sam','mohit'],'marks':[23,45,68]},index = ['p','q','r'])
df

    name  marks
p  karan     23
q    sam     45
r  mohit     68

## Rename

In [28]:
df

    name  marks
p  karan     23
q    sam     45
r  mohit     68

In [33]:
df.rename( {'marks':'Total_marks'},axis=1)

    name  Total_marks
p  karan           23
q    sam           45
r  mohit           68

In [34]:
df.rename({'q':'t'},axis =0)

    name  marks
p  karan     23
t    sam     45
r  mohit     68

## String

In [37]:
df['name'].str.islower()

p    True
q    True
r    True
Name: name, dtype: bool

In [41]:
df['name'] = df['name'].str.upper()

In [43]:
df

    name  marks
p  KARAN     23
q    SAM     45
r  MOHIT     68

In [44]:
df['name'].str.isupper().sum()

3

In [51]:
df.loc['p','name'] = "Arun Chauhan"
df.loc['q','name'] = "Karan Sharma"
df.loc['r','name'] = "Tanvi Sharma"

In [57]:
df

           name marks
p  Arun Chauhan    23
q  Karan Sharma    45
r  Tanvi Sharma    68

In [59]:
df[['First_name','Last_name']] = df['name'].str.split(expand = True)

In [60]:
df

           name marks First_name Last_name
p  Arun Chauhan    23       Arun   Chauhan
q  Karan Sharma    45      Karan    Sharma
r  Tanvi Sharma    68      Tanvi    Sharma

## DELETE

In [62]:
df.drop('name',axis = 1,inplace = True)

In [64]:
df

  marks First_name Last_name
p    23       Arun   Chauhan
q    45      Karan    Sharma
r    68      Tanvi    Sharma

In [65]:
df.drop('r',axis = 0, inplace = True)

### Replace

In [70]:
import numpy as np
df.loc['s'] = [75,'shyam', np.NAN]

In [71]:
df

  marks First_name Last_name
p    23       Arun   Chauhan
q    45      Karan    Sharma
s    75      shyam       NaN

In [74]:
df['Last_name'].replace(np.NAN,df['Last_name'].mode()[0],inplace = True)

In [75]:
df

  marks First_name Last_name
p    23       Arun   Chauhan
q    45      Karan    Sharma
s    75      shyam   Chauhan